Autodesk.Revit.DB.Structure.RebarHandleBehavior.CrankAtEndOnCrankEnd
The behavior can be set to an end of bar handle only if the bar has crank at end.
The plane of a RebarConstrainedHandle with behavior is situated exactly where the bar (with crank) ends.

Autodesk.Revit.DB.Structure.RebarHandleBehavior.CrankAtEndOnCrankSegment
The behavior can be set to an end of bar handle only if the bar has crank at end.
The plane of a RebarConstrainedHandle with behavior is situated at a crank length distance from where the bar (with crank) ends.

Autodesk.Revit.DB.Structure.RebarHandleBehavior.CrankAtEndOnBarSegment
The behavior can be set to an end of bar handle only if the bar has crank at end.
The plane of a RebarConstrainedHandle with behavior is situated at (crank length + crank angled length) distance from where the bar (with crank) ends. It's also the same as the default one.

Autodesk.Revit.DB.Structure.RebarHandleBehavior.CrankAtStartOnCrankEnd
The behavior can be set to a start of bar handle only if the bar has crank at start.
The plane of a RebarConstrainedHandle with behavior is situated exactly where the bar (with crank) ends.

Autodesk.Revit.DB.Structure.RebarHandleBehavior.CrankAtStartOnCrankSegment
The behavior can be set to a start of bar handle only if the bar has crank at start.
The plane of a RebarConstrainedHandle with behavior is situated at a crank length distance from where the bar (with crank) ends.

Autodesk.Revit.DB.Structure.RebarHandleBehavior.CrankAtStartOnBarSegment
The behavior can be set to a start of bar handle only if the bar has crank at start.
The plane of a RebarConstrainedHandle with behavior is situated at (crank length + crank angled length) distance from where the bar (with crank) ends. It's also the same as the default one.